org-glance.org
#+TITLE: org-glance
#+AUTHOR: Dmitry Akatov
#+EMAIL: akatovda@yandex.com
#+CATEGORY: org-glance
#+PROPERTY: REPO_ALL Dev Test Prod
#+TAGS: License Documentation
#+TAGS: Experiment Test
#+PROPERTY: header-args:emacs-lisp :tangle (oldt-tt '("Test" "org-glance-tests.el") '("Experiment" "no") '(t "yes")) :results silent :noweb yes
#+PROPERTY: header-args:markdown :tangle (oldt-tt '("Documentation" "README.md") '(t "no"))
#+PROPERTY: header-args:org :tangle no

* Hello
** README                                                                      :Documentation:
#+begin_src markdown
Org-glance: walk in the woods with pleasure
===============================

Fast, clean and convenient way of traversing your org-mode forest.

Turn org-mode into context-aware bookmark storage, password manager,
flexible build system or whatever you can imagine with ease.

## Running tests

### Batch mode

    emacs -batch -l ert -l org-glance-tests.el -f ert-run-tests-batch-and-exit

### Org-mode

Browse link `Setup development environment`. After that you can build
project using `C-x y m` key or running `org-glance-devtools/build`
command from `org-glance.org` buffer.
#+end_src
** License                                                                     :License:
#+begin_src emacs-lisp
;;; org-glance.el --- org-mode traversing. Fast and convenient.

;; Copyright (C) 2018-2019 Dmitry Akatov

;; Author: Dmitry Akatov <akatovda@yandex.com>
;; Created: 29 September, 2018
;; Version: 0.1

;; Keywords: org-mode tools
;; Homepage: https://github.com/rails-to-cosmos/org-glance

;; This file is not part of GNU Emacs.

;; This program is free software: you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with this program.  If not, see <http://www.gnu.org/licenses/>.

;;; Commentary:
;; This package allows you to manage bookmarks and travel around the
;; digital world with an org-mode power behind your shoulders.

;;; Code:
#+end_src
** Requirements
#+begin_src emacs-lisp
(require 'org)
(require 'cl-lib)
(require 'subr-x)
(require 'seq)
#+end_src
* Customs
#+begin_src emacs-lisp
(defgroup org-glance nil
  "\nOptions concerning glancing entries."
  :tag "Org Glance"
  :group 'org)

(defcustom org-glance-cache-file
  (concat user-emacs-directory "org-glance--org-glance-cache.org")
  "A file to store headlines visited."
  :group 'org-glance
  :type 'string)

(condition-case nil
    (make-directory (file-name-directory org-glance-cache-file))
  (error nil))

(defvar org-glance-defaults--separator " → ")
#+end_src
* Utils
** buffer-mode
#+begin_src emacs-lisp
(defun buffer-mode (&optional buffer-or-name)
  "Returns the major mode associated with a buffer.
If buffer-or-name is nil return current buffer's mode."
  (buffer-local-value 'major-mode
   (if buffer-or-name (get-buffer buffer-or-name) (current-buffer))))
#+end_src
** headline-tags
#+begin_src emacs-lisp
(defun org-glance-headline-contains-tags-p (&rest tags)
  (equal (seq-intersection tags (org-get-tags)) tags))
#+end_src
* Testing                                                                       :Test:
** requirements
#+begin_src emacs-lisp
(require 'ert)
(load-file "org-glance.el") ;; for batch-mode
(require 'org-glance)
#+end_src
** utils
*** trim-string
#+begin_src emacs-lisp
(defun trim-string (string)
  "Remove white spaces in beginning and ending of STRING.
White space here is any of: space, tab, emacs newline (line feed, ASCII 10)."
  (replace-regexp-in-string "\\`[ \t\n]*" "" (replace-regexp-in-string "[ \t\n]*\\'" "" string)))
#+end_src
*** with-temp-org-buffer
#+begin_src emacs-lisp
(defmacro with-temp-org-buffer (s &rest forms)
  "Create a temporary org-mode buffer with contents S and execute FORMS."
  `(save-excursion
     (with-temp-buffer
       (org-mode)
       (goto-char 0)
       (insert ,s)
       (goto-char 0)
       ,@forms)))

(defmacro org-glance--with-temp-filebuffer (&rest body)
  "Open temp-file with org-glance prefix into a temporary buffer
execute BODY there like `progn', then kill the buffer and delete
the file returning the result of evaluating BODY."
  `(save-window-excursion
     (let ((fn (make-temp-file "org-glance-")))
       (find-file fn)
       (unwind-protect
           ,@body
         (save-buffer)
         (kill-buffer)
         (delete-file fn)))))
#+end_src
*** test-links
#+begin_src emacs-lisp
(defun org-glance-test (&rest args)
  (save-excursion
    (with-temp-buffer
      (org-mode)
      (let* ((context (plist-get args :context))
             (input (plist-get args :input))
             (action (plist-get context :action))
             (expected (plist-get context :expected))
             (begin-marker (with-current-buffer (messages-buffer)
                             (point-max-marker)))
             (expression (format "(+ %i %i)" (random 10) (random 10)))
             (buffer (current-buffer))
             (org-confirm-elisp-link-function nil)
             (unread-command-events
              (listify-key-sequence
               (kbd (format "%s RET" input)))))
        (insert (format "* [[elisp:%s][%s]]" (org-link-escape expression) input))
        (apply 'org-glance context)
        (cond (action (= (funcall action) expected))
              (t (string= (format "%s => %s" expression (eval (read expression)))
                          (thread-first
                              (with-current-buffer (messages-buffer)
                                (buffer-substring begin-marker (point-max-marker)))
                            s-lines butlast -last-item trim-string))))))))
#+end_src
* Classes                                                                       :Experiment:
** og-scope

#+begin_src emacs-lisp
(defclass og-scope ()
  ((source :type (or string buffer)
           :initarg :source)

   ;; private declarations
   (name :type string
         :initarg :name)

   (type :type symbol
         :initarg :type)

   (headlines :type list
              :initarg :headlines)

   (state :type (or string nil)
          :initarg :state))
  "Unified interface for buffer/file scopes.")

(cl-defmethod initialize-instance :after ((scope og-scope) &rest args)
  ;; determine scope type
  (let ((source (oref scope :source)))

    ;; Possible beautify and optimization: switch to opened buffer instead of finding file
    ;; (live-buffers (remove nil (mapcar 'buffer-file-name (buffer-list))))

    ;; determine scope type
    (oset scope :type
          (cond ((and (stringp source) (file-exists-p source))
                 'file)

                ((and (bufferp source) (buffer-file-name source) (file-exists-p (buffer-file-name source)))
                 'file-buffer)

                ((bufferp source)
                 'buffer)))

    ;; determine scope name
    (oset scope :name
          (case (oref scope :type)
            ('buffer
             (buffer-name source))

            ('file
             (expand-file-name source))

            ('file-buffer
             (expand-file-name (buffer-file-name source)))))

    ;; determine scope state and contents
    (case (oref scope :type)
      ('buffer
       (with-current-buffer source
         (oset scope :state (buffer-hash))
         (oset scope :headlines (org-element-parse-buffer 'headline))))

      ('file
       (with-temp-buffer
         (insert-file-contents source)
         (oset scope :state (buffer-hash))
         (oset scope :headlines (org-element-parse-buffer 'headline))))

      ('file-buffer
       (with-temp-buffer
         (insert-file-contents (buffer-file-name source))
         (oset scope :state (buffer-hash))
         (oset scope :headlines (org-element-parse-buffer 'headline)))))))

;; (let ((headlines (oref scope headlines)))
;;   (org-element-map headlines 'headline
;;     (lambda (headline)
;;       headline
;;       ;; (org-element-property "ITEM" headline)
;;       ))

;;   ;; (cl-loop for (title level) in entries
;;   ;;          for i below (length entries)
;;   ;;          with prev-level
;;   ;;          initially (progn
;;   ;;                      (goto-char (point-max))
;;   ;;                      (org-insert-heading nil nil t)
;;   ;;                      (insert scope)
;;   ;;                      (org-set-property "CREATED" (current-time-string))
;;   ;;                      (org-set-property "STATE" state)
;;   ;;                      (org-insert-heading-respect-content)
;;   ;;                      (org-do-demote))
;;   ;;          do (progn
;;   ;;               (insert title)
;;   ;;               (when prev-level
;;   ;;                 (cond ((> prev-level level) (dotimes (ld (- prev-level level)) (org-do-promote)))
;;   ;;                       ((< prev-level level) (dotimes (ld (- level prev-level)) (org-do-demote))))))

;;   ;;          when (< (+ i 1) (length entries))
;;   ;;          do (progn
;;   ;;               (org-insert-heading-respect-content)
;;   ;;               (setq prev-level level)))
;;   )
#+end_src

** og-cache

#+begin_src emacs-lisp
(defclass og-cache ()
  ((scopes :type hash-table
           :initform (cl-make-hash-table :test #'equal)
           :initarg :scopes)))

(cl-defmethod og-cache--add-scope ((cache og-cache) scope)
  "Insert SCOPE into CACHE if scope state has been modified then return t.
If state has not been modified, do not update CACHE and return nil."
  (with-slots (name state) scope
    (let* ((scopes (oref cache :scopes))
           (ex-scope (gethash name scopes)))
      (if ex-scope
          (unless (equal state (oref ex-scope :state))
            (puthash name scope scopes)
            t)
        (puthash name scope scopes)
        t))))

(ert-deftest og-cache-test/scoping ()
  (let ((scope (og-scope :source (current-buffer)))
        (cache (og-cache)))
    (og-cache--add-scope cache scope)))

(ert-run-tests-batch 'og-cache-test/scoping)
#+end_src

* Features
