org-glance.org
** org-glance
#+begin_src emacs-lisp
(defun org-glance (&rest args)
  "Use optional ARGS to customize your glancing blows:
- SCOPE :: org-file or SCOPE from org-map-entries (org.el)
- PROMPT :: completing read title (default: \"Glance: \")
- SEPARATOR :: completing read entry separator (default: \" → \")
- FILTER :: list or one filter of type lambda/symbol/string to specify entries in completing read.

  Possible default filters:
  - links :: keep entries with link in title
  - encrypted :: keep entries with :crypt: tag

  You can customize default filters by setting org-glance--default-filters variable.

- ACTION
  - if specified, call it with point on selected entry
  - if entry has an org-link in title, browse it
- OUTLINE-IGNORE :: list of strings to ignore in outline-path

- INPLACE :: do not build scope file if specified

\(fn [:scope SCOPE] [:prompt PROMPT] [:separator SEPARATOR] [:filter FILTER] [:action ACTION])"
  (let* ((user-scopes (or (plist-get args :scope)          nil))
         (aggregated-scopes (org-glance--aggregate-scopes user-scopes))
         (err-nothing-found (or (plist-get args :nothing-found-msg) "Nothing to glance for"))

         (user-filter (or (plist-get args :filter)       (lambda () t)))

         (save-outline-visibility-p (plist-get args :save-outline-visibility))
         (no-cache-file-p           (plist-get args :no-cache-file))
         (org-glance-cache-file (if no-cache-file-p
                                    (make-temp-file "org-glance-")
                                  org-glance-cache-file))

         (outline-settings (record 'org-glance-settings--outline
                                   :scope (or aggregated-scopes (list (current-buffer)))
                                   :separator (or (plist-get args :separator) org-glance-defaults--separator)
                                   :outline-ignore (plist-get args :outline-ignore)
                                   :inplace t ;; (plist-get args :inplace)
                                   ;; temporary while outplace completions fail
                                   :filters (org-glance--filter-predicates user-filter)))

         (prompt    (or (plist-get args :prompt)         "Glance: "))
         (action    (or (plist-get args :action)         nil))

         (entries (or (org-glance--entries outline-settings)
                      (error "%s %s"
                             err-nothing-found
                             (prin1-to-string aggregated-scopes))))
         (result (org-glance--compl-visit prompt entries action save-outline-visibility-p)))
    (when no-cache-file-p
      (when-let ((fb (get-file-buffer org-glance-cache-file)))
        (kill-buffer fb))
      (delete-file org-glance-cache-file))
    result))
#+end_src
** outliner
#+begin_src emacs-lisp
(defun org-glance--get-entry-coordinates (&rest args)
  "Return outline path of current `'org-mode`' entry.

Org node titles separated by SEPARATOR, titles specified in
OUTLINE-IGNORE will be ignored.

All FILTERS lambdas must be t."
  (let* ((separator           (or (plist-get args :separator)           org-glance-defaults--separator))
         (outline-ignore      (or (plist-get args :outline-ignore)      nil))
         (filters             (or (plist-get args :filters)             nil))
         (inplace-p           (or (plist-get args :inplace)             nil))
         (scope               (or (plist-get args :scope)               nil))
         (item (org-entry-get (point) "ITEM"))
         (path (funcall (if inplace-p 'append 'cdr) (org-get-outline-path t)))
         (outline (cl-set-difference path outline-ignore :test 'string=))
         (coordinates (mapconcat 'identity (cl-list* ;; (org-glance-scope--get-name scope)
                                                     outline) separator)))
    (when (and (cl-every 'funcall filters)
               (not (thread-first coordinates s-trim string-empty-p)))
      (list coordinates (point-marker)))))
#+end_src
** visitor
*** impl
#+begin_src emacs-lisp
(defun org-glance-scope--visitor (settings scope)
  (save-window-excursion
    (let* ((scope               (aref settings 2))
           (separator           (aref settings 4))
           (outline-ignore      (aref settings 6))
           (inplace-p           (aref settings 8))
           (filters             (aref settings 10)))
      (org-glance-cache--read-contents scope)
      (org-map-entries (apply-partially
                        'org-glance--get-entry-coordinates
                        :separator separator
                        :outline-ignore outline-ignore
                        :filters filters
                        :inplace inplace-p
                        :scope scope)))))
#+end_src
*** visit-entry-at-point
#+begin_src emacs-lisp
(defun org-glance--visit-entry-at-point (&optional action)
  (save-excursion
    (if action
        (funcall action)
      (let* ((line (thing-at-point 'line t))
             (search (string-match org-any-link-re line))
             (link (substring line (match-beginning 0) (match-end 0))))
        (org-open-link-from-string link)))))
#+end_src
*** compl-visit
#+name: compl-visit
#+begin_src emacs-lisp
(defun org-glance--compl-visit (prompt entries action &optional save-outline-visibility-p)
  "PROMPT org-completing-read on ENTRIES and call ACTION on selected.
If there are no entries, raise exception."
  (when (seq-empty-p entries)
    (error "Empty set"))

  (let* ((choice (org-completing-read prompt entries))
         (marker (cadr (assoc-string choice entries)))
         (org-link-frame-setup (cl-acons 'file 'find-file org-link-frame-setup)))
    (with-current-buffer (marker-buffer marker)
      (org-goto-marker-or-bmk marker)
      (org-glance--visit-entry-at-point action))))
#+end_src
*** Tests [4/4]
**** DONE Can visit empty cache file                                         :Test:
#+begin_src emacs-lisp
(ert-deftest org-glance-test/can-work-with-empty-cache-file ()
  "Should work with empty cache file."
  (should
   (org-glance-test
    :context '(:no-cache-file t)
    :input "Hello")))
#+end_src
**** DONE Can visit org-links                                                :Test:
#+begin_src emacs-lisp
(ert-deftest org-glance-test/can-handle-org-links ()
  "Test that we can handle org-links."
  (should
   (org-glance-test
    :context '(:no-cache-file t)
    :input "elisp-link")))
#+end_src
**** DONE Can complete non-file buffers                                      :Test:
#+begin_src emacs-lisp
(ert-deftest org-glance-test/compl-non-file-buffer ()
  "Should work properly from non-file buffers."
  (should
   (org-glance-test
    :context '(:no-cache-file t
               :inplace t
               :scope (list buffer))
    :input "elisp-link")))
#+end_src
**** DONE Can call custom action on entry                                    :Test:
#+begin_src emacs-lisp
(ert-deftest org-glance-test/call-custom-action ()
  "Should call custom action if specified."
  (should
   (org-glance-test
    :context '(:action (lambda () 1)
               :expected 1
               :inplace t
               :scope (list buffer))
    :input "elisp-link")))
#+end_src
** entries
#+begin_src emacs-lisp
(defun org-glance--entries (settings)
  "Return glance entries by SCOPE.

Specify SEPARATOR and OUTLINE-IGNORE to customize
outline-paths appearence.

When INPLACE flag specified, do not modify *org-glance-scope* buffer.

Add some FILTERS to filter unwanted entries."
  (let* ((scope               (aref settings 2))
         (separator           (aref settings 4))
         (outline-ignore      (aref settings 6))
         (inplace-p           (aref settings 8))
         (filters             (aref settings 10))

         ;; Possible beautify and optimization: switch to opened buffer instead of finding file
         ;; (live-buffers (remove nil (mapcar 'buffer-file-name (buffer-list))))

         (handler (apply-partially (if inplace-p
                                       #'org-glance-scope--visitor
                                     #'org-glance-scope--implant)
                                   settings)))

    ;; (-keep (mapcar 'org-glance-scope--get-type scope))
    (loop for fob in scope
          append (let* ((scope-type (org-glance-scope--get-type fob))
                        (entries (funcall handler fob)))
                   (remove nil entries)))))
#+end_src
** scoping
